//////////////////////////////////////////////////////////////////////

// CameraDS.cpp: implementation of the CCameraDS class.
//
//////////////////////////////////////////////////////////////////////

#include "CameraDS.h"
#include "OSD.h"
#include "hlogConfig.h"
#include<time.h>
#include<iostream>
#include<stdexcept>

using namespace std;

CCameraDS* CCameraDS::m_instance = NULL;

unsigned int audiosamplerate = 44100;    //音频采样率
unsigned int videoframetype =  0;    //视频帧类型
unsigned int framerate = 30;

typedef struct _HIK_MEDIAINFO_    //海康数据头
{
    unsigned int    media_fourcc;   // "HKMI": 0x484B4D49 Hikvision Media Information
    unsigned short  media_version;   // 版本号：指本信息结构版本号，目前为0x0101,即1.01版本，01：主版本号；01：子版本号。
    unsigned short  device_id;    // 设备ID，便于跟踪/分析   

    unsigned short  system_format;          // 系统封装层 0表示没有封装，0x0002 ps封装  0x0004 rtp封装
                                            //0x0007AVI封装0x0005MP4文件层，兼容3GP文件层 0x0003 TS封装
    unsigned short  video_format;           // 视频编码类型 0x0100 标准H.264 0x0003 标准MPEG4; 

    unsigned short  audio_format;           // 音频编码类型
    unsigned char   audio_channels;         // 通道数，1：单通道；2：双通道  
    unsigned char   audio_bits_per_sample;  // 样位率
    unsigned int    audio_samplesrate;      // 采样率 
    unsigned int    audio_bitrate;          // 压缩音频码率,单位：bit
    unsigned int    reserved[4];            // 保留
}HIK_MEDIAINFO;
//#define AUDIO_G711_U		0x7110
//#define AUDIO_G711_A		0x7111
//#define AUDIO_G722_1		0x7221
//#define AUDIO_G723_1        0x7231
//#define AUDIO_G726_32       0x7260  //默认G726-32
//#define AUDIO_G726_16       0x7262      
//#define AUDIO_AAC               0x2001 // MPEG2-AAC-ADTS
//#define AUDIO_MPEG               0x2000 // MPEG2-AAC-ADTS
//#define AUDIO_RAW_UDATA16(pcm) 0x7001      //采样率为16k的原始数据，即L16

enum TransMode
{
    TD_H264 = 0,		//H264编码
    TD_MPEG4 =1,	//MPEG4编码
};
#define TS_PACKET_HEADER               4
#define TS_PACKET_SIZE                 188
#define TS_SYNC_BYTE                   0x47
#define TS_PAT_PID                     0x00
#define TS_PMT_PID                     0xFFF
#define TS_H264_PID                    0x100
#define TS_AAC_PID                     0x101
#define TS_H264_STREAM_ID              0xE0
#define TS_AAC_STREAM_ID               0xC0
#define PMT_STREAM_TYPE_VIDEO          0x1B
#define PMT_STREAM_TYPE_AUDIO          0x0F
#define MAX_ONE_FRAME_SIZE             1024 * 1024

//ts 包头
typedef struct Tag_PacketHeader
{
    unsigned char sync_byte         :8  ;         //同步字节, 固定为0x47,表示后面的是一个TS分组
    unsigned char tras_error        :1  ;         //传输误码指示符   
    unsigned char play_init         :1  ;         //有效荷载单元起始指示符
    unsigned char tras_prio	        :1  ;         //传输优先, 1表示高优先级,传输机制可能用到，解码用不着
    unsigned int  PID               :13 ;         //PID
    unsigned char tras_scramb       :2  ;         //传输加扰控制
    unsigned char ada_field_C       :2  ;         //自适应控制 01仅含有效负载，10仅含调整字段，11含有调整字段和有效负载，先调整字段然后有效负载。为00解码器不进行处理 
    unsigned char conti_cter        :4  ;         //连续计数器 一个4bit的计数器，范围0-15
}TsPacketHeader; 

//PAT结构体：节目相关表
typedef struct Tag_TsPat
{
    unsigned char table_id :8 ;                  //固定为0x00 ，标志是该表是PAT
    unsigned char section_syntax_indicator: 1;   //段语法标志位，固定为1
    unsigned char zero : 1;                      //0 
    unsigned char reserved_1 : 2;                //保留位
    unsigned int section_length : 12 ;           //表示这个字节后面有用的字节数，包括CRC32
    unsigned int transport_stream_id : 16 ;      //该传输流的ID，区别于一个网络中其它多路复用的流
    unsigned char reserved_2 : 2;                //保留位
    unsigned char version_number : 5 ;           //范围0-31，表示PAT的版本号
    unsigned char current_next_indicator : 1 ;   //发送的PAT是当前有效还是下一个PAT有效
    unsigned char section_number : 8 ;           //分段的号码。PAT可能分为多段传输，第一段为00，以后每个分段加1，最多可能有256个分段
    unsigned char last_section_number : 8 ;      //最后一个分段的号码
    unsigned int program_number  : 16 ;          //节目号
    unsigned char reserved_3  : 3  ;             //保留位
    unsigned int network_PID :13 ;               //网络信息表（NIT）的PID,节目号为0时对应的PID为network_PID,本例中不含有 networke_pid
    unsigned int program_map_PID : 13;           //节目映射表的PID，节目号大于0时对应的PID，每个节目对应一个
    unsigned int CRC_32  : 32;             //CRC32校验码
}TsPat; 

//PMT结构体：节目映射表
typedef struct Tag_TsPmt
{
    unsigned char table_id  : 8;                 //固定为0x02, 表示PMT表
    unsigned char section_syntax_indicator : 1;  //固定为0x01
    unsigned char zero: 1;                       //0x00
    unsigned char reserved_1 : 2;                //0x03
    unsigned int section_length: 12;             //首先两位bit置为00，它指示段的byte数，由段长度域开始，包含CRC。
    unsigned int program_number : 16;            // 指出该节目对应于可应用的Program map PID
    unsigned char reserved_2: 2;                 //0x03
    unsigned char version_number: 5;             //指出TS流中Program map section的版本号
    unsigned char current_next_indicator: 1;     //当该位置1时，当前传送的Program map section可用；当该位置0时，指示当前传送的Program map section不可用，下一个TS流的Program map section有效。
    unsigned char section_number : 8;            //固定为0x00
    unsigned char last_section_number: 8;        //固定为0x00
    unsigned char reserved_3 : 3;                //0x07
    unsigned int PCR_PID : 13;                   //指明TS包的PID值，该TS包含有PCR域，该PCR值对应于由节目号指定的对应节目。如果对于私有数据流的节目定义与PCR无关，这个域的值将为0x1FFF。
    unsigned char reserved_4 : 4;                //预留为0x0F
    unsigned int program_info_length : 12;       //前两位bit为00。该域指出跟随其后对节目信息的描述的byte数。
    unsigned char stream_type_video : 8;         //指示特定PID的节目元素包的类型。该处PID由elementary PID指定
    unsigned char reserved_5_video: 3;           //0x07
    unsigned int elementary_PID_video: 13;       //该域指示TS包的PID值。这些TS包含有相关的节目元素
    unsigned char reserved_6_video : 4;          //0x0F
    unsigned int ES_info_length_video : 12;      //前两位bit为00。该域指示跟随其后的描述相关节目元素的byte数
    unsigned char stream_type_audio : 8;         //指示特定PID的节目元素包的类型。该处PID由elementary PID指定
    unsigned char reserved_5_audio: 3;           //0x07
    unsigned int elementary_PID_audio: 13;       //该域指示TS包的PID值。这些TS包含有相关的节目元素
    unsigned char reserved_6_audio : 4;          //0x0F
    unsigned int ES_info_length_audio : 12;      //前两位bit为00。该域指示跟随其后的描述相关节目元素的byte数
    unsigned long long CRC_32: 32;               //CRC32校验码
}TsPmt; 

//连续性计数器,也就是说 有多少个 pat包，几个pmt包 ，几个MP3 包，几个 h264包，0x00 - 0x0f ，然后折回到0x00 用于查看丢包                            
typedef struct Tag_Continuity_Counter
{
    unsigned char continuity_counter_pat;
    unsigned char continuity_counter_pmt;
    unsigned char continuity_counter_video;
    unsigned char continuity_counter_audio;
}Continuity_Counter;

//自适应段标志
typedef struct Tag_Ts_Adaptation_field
{
    unsigned char discontinuty_indicator:1;                //1表明当前传送流分组的不连续状态为真
    unsigned char random_access_indicator:1;               //表明下一个有相同PID的PES分组应该含有PTS字段和一个原始流访问点
    unsigned char elementary_stream_priority_indicator:1;  //优先级
    unsigned char PCR_flag:1;                              //包含pcr字段
